<a href="https://colab.research.google.com/github/Navneetgit-hub/DMDWLAB2/blob/main/18cse202pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
data=[1,2,3,4,5]
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [3]:
data=[['Navneet',10],['Nitin',15],['Tagore',20]]
df=pd.DataFrame(data)
df

         0   1
0  Navneet  10
1    Nitin  15
2   Tagore  20

In [4]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:

dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.789864  0.696455 -3.297775 -0.052548
2013-01-02 -0.734176  0.853493  0.363344 -0.264815
2013-01-03  0.986176  0.465415 -0.063592 -0.496976
2013-01-04 -1.068167 -1.072196 -0.185378 -1.452488
2013-01-05 -0.009085 -0.494412 -0.066247  2.447613
2013-01-06  0.824629 -0.569675 -1.780285  0.790785

In [7]:
df2 = pd.DataFrame({'A': 1.,'B': pd.Timestamp('20130102'),'C': pd.Series(1, index=list(range(4)), dtype='float32'),'D': np.array([3] * 4, dtype='int32'),'E': pd.Categorical(["test", "train", "test", "train"]),'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [8]:

df.head()

                   A         B         C         D
2013-01-01  0.789864  0.696455 -3.297775 -0.052548
2013-01-02 -0.734176  0.853493  0.363344 -0.264815
2013-01-03  0.986176  0.465415 -0.063592 -0.496976
2013-01-04 -1.068167 -1.072196 -0.185378 -1.452488
2013-01-05 -0.009085 -0.494412 -0.066247  2.447613

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.068167 -1.072196 -0.185378 -1.452488
2013-01-05 -0.009085 -0.494412 -0.066247  2.447613
2013-01-06  0.824629 -0.569675 -1.780285  0.790785

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:

df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:

df.to_numpy()

array([[ 0.78986412,  0.69645454, -3.29777541, -0.05254753],
       [-0.73417612,  0.85349269,  0.36334355, -0.26481485],
       [ 0.98617572,  0.46541511, -0.0635917 , -0.49697628],
       [-1.06816695, -1.07219622, -0.18537844, -1.45248827],
       [-0.00908531, -0.4944118 , -0.06624727,  2.44761269],
       [ 0.82462888, -0.56967501, -1.78028451,  0.79078489]])

In [13]:

df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.131540 -0.020153 -0.838322  0.161928
std    0.877804  0.793253  1.414415  1.333298
min   -1.068167 -1.072196 -3.297775 -1.452488
25%   -0.552903 -0.550859 -1.381558 -0.438936
50%    0.390389 -0.014498 -0.125813 -0.158681
75%    0.815938  0.638695 -0.064256  0.579952
max    0.986176  0.853493  0.363344  2.447613

In [15]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.789864   -0.734176    0.986176   -1.068167   -0.009085    0.824629
B    0.696455    0.853493    0.465415   -1.072196   -0.494412   -0.569675
C   -3.297775    0.363344   -0.063592   -0.185378   -0.066247   -1.780285
D   -0.052548   -0.264815   -0.496976   -1.452488    2.447613    0.790785